snlkuharlocal/src/Documents/ЭмиссияПодарочныхСертификатов/ЭмиссияПодарочныхСертификатов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЭмиссияПодарочныхСертификатов</name>
  <basedOn>Document.Перемещение</basedOn>
  <basedOn>Document.СписаниеТМЦ</basedOn>
  <basedOn>Document.РасходнаяНакладная</basedOn>
  <registerRecords>AccumulationRegister.СертификатныеОстатки</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиТМЦ</registerRecords>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <comment>Подразделение в которое выдаются сертификаты</comment>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>НачНомер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонНомер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Номинал</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокДействия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Подарок</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидСертификата</name>
    <type>
      <types>CatalogRef.ВидыПодарочныхСертификатов</types>
    </type>
  </attributes>
  <attributes>
    <name>КодОперации</name>
    <type>
      <types>EnumRef.КодыОперацийПС</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокОснование</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеЗатрат</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>Отработано</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>СертификатыАктивированы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СертификатыЭмитированы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПриниматьКРасходамНУ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаДействияСертификатов</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияДействияСертификатов</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МаксимальныйПроцентОтоваривания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СертификатыДеактивированы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаДеактивации</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НомераКарт</name>
    <type>
      <types>DocumentRef.НомераКарт</types>
    </type>
  </attributes>
  <attributes>
    <name>Эмитент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Сертификаты</name>
    <attributes>
      <name>КодСертификата</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>13</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номинал</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Подразделения</name>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.Подразделения</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/AccumulationRegisters/СертификатныеОстатки/СертификатныеОстатки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>СертификатныеОстатки</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>КодОперации</name>
    <type>
      <types>EnumRef.КодыОперацийОстатки</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сертификат</name>
    <type>
      <types>CatalogRef.ПодарочныеСертификаты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

snlkuharlocal/src/InformationRegisters/РеквизитыПодарочныхСертификатов/РеквизитыПодарочныхСертификатов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РеквизитыПодарочныхСертификатов</name>
  <resources>
    <name>ЗначениеРеквизита</name>
    <type>
      <types>String</types>
      <types>CatalogRef</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сертификат</name>
    <type>
      <types>CatalogRef.ПодарочныеСертификаты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИмяРеквизита</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/Enums/КодыОперацийПС/КодыОперацийПС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КодыОперацийПС</name>
  <comment>Коды операций с подарочными сертификатами</comment>
  <enumValues>
    <name>Инициализаиця</name>
  </enumValues>
  <enumValues>
    <name>Дарение</name>
  </enumValues>
  <enumValues>
    <name>Активация</name>
  </enumValues>
  <enumValues>
    <name>Деактивация</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/ВидыПодразделений/ВидыПодразделений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыПодразделений</name>
  <enumValues>
    <name>Торговое</name>
  </enumValues>
  <enumValues>
    <name>Управляющее</name>
  </enumValues>
  <enumValues>
    <name>Сервисное</name>
  </enumValues>
  <enumValues>
    <name>Франчайзинг</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Documents/ЭмиссияПодарочныхСертификатов/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения) Экспорт
	//++Ратманов управляемые блокировки
	Если НЕ ПроведениеС.БлокировкаПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	Если НЕ ПроведениеС.КонтрольПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	//--Ратманов управляемые блокировки
	СписокСертПоКоду=новый СписокЗначений;
	для каждого СтрокаСерт из Сертификаты цикл
	СписокСертПоКоду.Добавить(Справочники.ПодарочныеСертификаты.НайтиПоКоду(СтрокаСерт.КодСертификата));
	КонецЦикла;
	СписокСерт=УчетСертификатов.КонтрольКоличестваСертификатовСписком(СписокСертПоКоду,Склад,Дата);
	
	если СписокСерт<>неопределено Тогда 
	//кухарь 09.06.14 конец
		для Каждого ТекСерт из СписокСерт Цикл 
			Если ТекСерт.количество<1 тогда
				#ЕСЛИ КЛИЕНТ ТОГДА
					Сообщить("Сертификат с кодом "+ТекСерт.Сертификат+" отсутствует на остатках по данному складу");
				#КонецЕсли
				СписаниевМинус=Истина;
			КонецЕсли;	
		КонецЦикла;
	КонецЕсли;

	Если КодОперации=Перечисления.КодыОперацийПС.Дарение И Сертификаты.Количество() > 0 Тогда
		для каждого СтрокаСерт из Сертификаты цикл
			ТекСерт=Справочники.ПодарочныеСертификаты.НайтиПоРеквизиту("КодСертификата",СтрокаСерт.КодСертификата);
			если ТекСерт=Справочники.ПодарочныеСертификаты.ПустаяСсылка() тогда
				Продолжить;
			КонецЕсли;

			Движение = Движения.СертификатныеОстатки.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = Дата;
			Движение.Склад =Склад;		
			Движение.Сертификат = ТекСерт;
			Движение.Количество = 1;
			Движение.Сумма = ТекСерт.Номинал;
			Движение.Регистратор=Ссылка;
			Движение.Подразделение=Склад.Подразделение;
			движение.КодОперации=Перечисления.КодыОперацийОстатки.Реализация;
			
		КонецЦикла;
	если ОбменДанными.Загрузка тогда
		Движения.СертификатныеОстатки.Записать();
	КонецЕсли;
	КонецЕсли;	
	//списываем подарки с остатков
	Если КодОперации=Перечисления.КодыОперацийПС.Дарение И Сертификаты.Количество() > 0 Тогда
		Движение=Движения.ОстаткиТМЦ.Добавить();	
		
		Движение.Активность		= Истина;
		Движение.Период			= Дата;		
		
		Движение.Склад			= Склад;	
		
		Движение.Номенклатура	= Номенклатура;			
		Движение.Количество		= Количество;		
		
		Движение.Сумма			= 0;		
		
		Движение.Оборот			= 0;		
		Движение.ОборотБезСкидки= 0;
		
		Движение.КодОперации	= Перечисления.КодыОперацийОстатки.Списание;
		
		Движение.Отправитель	= Справочники.СтатьиЗатрат.НайтиПоКоду("320 520");		
		
		Движение.ВидДвижения	= ВидДвиженияНакопления.Расход;
		Если ОбменДанными.Загрузка Тогда 
			Движения.ОстаткиТМЦ.Записать();	
		КонецЕсли; 
	КонецЕсли;
	
	Если СертификатыЭмитированы И КодОперации=Перечисления.КодыОперацийПС.Инициализаиця Тогда Возврат Конецесли;
	Если СертификатыАктивированы И КодОперации=Перечисления.КодыОперацийПС.Дарение Тогда Возврат Конецесли;
	Если СертификатыАктивированы И КодОперации=Перечисления.КодыОперацийПС.Активация Тогда Возврат Конецесли;

	//деактивация
	Если СертификатыДеактивированы И КодОперации = Перечисления.КодыОперацийПС.Деактивация Тогда Возврат КонецЕсли;

	Если ОбменДанными.Загрузка Тогда Возврат КонецЕсли;

	Если КодОперации=Перечисления.КодыОперацийПС.Деактивация И ПараметрыСеанса.ТипУзла<>Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда
		СообщитьОбОшибке("Деактивация ПС возможна только в ЦО !",Отказ);
		Возврат;
	КонецЕсли;
	
	Если КодОперации=Перечисления.КодыОперацийПС.Дарение И ПараметрыСеанса.ЭтотУзел.Подразделение<>Подразделение И Сертификаты.Количество()>0 И ПараметрыСеанса.ЭтотУзел.ТипУзла <> Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда
		СообщитьОбОшибке("Подарки предназначены для подразделения: """+Подразделение+""" !",Отказ);		
		Возврат;
	КонецЕсли; 
	
	Для Каждого СтрокаТЧ Из Сертификаты Цикл
		КодСертификата=СтрокаТЧ.КодСертификата;
		Сертификат=Справочники.ПодарочныеСертификаты.НайтиПоКоду(КодСертификата);	
		
		Если КодОперации=Перечисления.КодыОперацийПС.Инициализаиця Тогда		
			Если НЕ Сертификат.Пустая() Тогда			
				Если НЕ Сертификат.Документ.Пустая() И Сертификат.Документ<>Ссылка Тогда
					Отказ=Истина;		
					СообщитьОбОшибке("Сертификат: """+КодСертификата+""" инициализирован другим документом ! "+Сертификат.Документ,Отказ);				
				ИначеЕсли ЗначениеЗаполнено(Сертификат.ДатаВыдачи) Тогда
					СообщитьОбОшибке("Сертификат: """+КодСертификата+""" уже выдавался !",Отказ);				
				ИначеЕсли ЗначениеЗаполнено(Сертификат.ДатаПогашения) Тогда							
					СообщитьОбОшибке("Сертификат: """+КодСертификата+""" погашен !",Отказ);												
				Иначе				
					СертификатОбъект=Сертификат.ПолучитьОбъект();
				КонецЕсли;
			Иначе
				СертификатОбъект=Справочники.ПодарочныеСертификаты.СоздатьЭлемент();
			КонецЕсли;			
			
			Если СертификатОбъект<>Неопределено Тогда
				СертификатОбъект.Эмитент=Организация;	
				//крохин начало
				//для инициализации используем номинал и номенклатуру из ТЧ
				//СертификатОбъект.Владелец				=Номенклатура;
				СертификатОбъект.Владелец				=СтрокаТЧ.Номенклатура;
				//крохин конец
				
				СертификатОбъект.Код					=КодСертификата;
				//крохин начало
				//для инициализации используем номинал и номенклатуру из ТЧ
				//СертификатОбъект.Номинал				=Номинал;
				СертификатОбъект.Номинал                =СтрокаТЧ.Номинал; 
				//крохин конец
				СертификатОбъект.СрокДействия			=СрокДействия;
				СертификатОбъект.ПодразделениеПолучатель=Подразделение;				
				
				// нечаева 15,10,14 ++ для подарочных карт
				Если СтрокаТЧ.Номенклатура = Справочники.Номенклатура.НайтиПоКоду("SNL-357490") или 
					СтрокаТЧ.Номенклатура = Справочники.Номенклатура.НайтиПоКоду("SNL-357492") или
					СтрокаТЧ.Номенклатура = Справочники.Номенклатура.НайтиПоКоду("SNL-357494")
					Тогда	
					
					СертификатОбъект.Подарок = истина;
					
				КонецЕсли;
				// нечаева 15,10,14 --
				
				
				// нечаева 13,10,2014 ++
				СертификатОбъект.НачалоДействия = ДатаНачалаДействияСертификатов;
				СертификатОбъект.ОкончаниеДействия = ДатаОкончанияДействияСертификатов;
				// нечаева 13,10,2014--- 
				
				СертификатОбъект.КодСертификата     =КодСертификата; 
				Если КодОперации=Перечисления.КодыОперацийПС.Дарение Тогда
					//нечаева +++
					Если НЕ Подразделение.ВидПодразделения=перечисления.ВидыПодразделений.Франчайзинг Тогда
						СертификатОбъект.Подарок 		= Истина;
					КонецЕсли;
					//нечаева ---
					СертификатОбъект.ДатаВыдачи 	= Дата;	
				КонецЕсли;				
				СертификатОбъект.Документ			=Ссылка;
				
				// Шворобей ВЮ 20.03.2023 ++
				СертификатОбъект.ВидСертификата	= ?(ЗначениеЗаполнено(ВидСертификата), ВидСертификата,
							Справочники.ВидыПодарочныхСертификатов.ЕЕ);   
				// Шворобей ВЮ 20.03.2023 ++
				
				СертификатОбъект.Записать();
			КонецЕсли;
		//крохин начало 04.12.2018
		//деактивация
	    ИначеЕсли КодОперации = Перечисления.КодыОперацийПС.Деактивация Тогда
		Если Сертификат.Пустая() Тогда
				СообщитьОбОшибке("Сертификат: """+КодСертификата+""" не инициализирован !",Отказ);							
			Иначе
				СертификатОбъект=Сертификат.ПолучитьОбъект();
				СертификатОбъект.Комментарий = "Сертификат деактивирован(запрещен к приему) "+Формат(Дата,"ДФ=dd.MM.yyyy")+"."; 
				Если НЕ ПустаяСтрока(ПричинаДеактивации) Тогда
				СертификатОбъект.Комментарий = СертификатОбъект.Комментарий + " Причина: "+ПричинаДеактивации;
				СертификатОбъект.Код = "D"+Прав(СертификатОбъект.КодСертификата,12);
			    КонецЕсли;
			    СертификатОбъект.Записать();
            КонецЕсли;
		//крохин конец 04.12.2018
		Иначе
			Если Сертификат.Пустая() Тогда
				СообщитьОбОшибке("Сертификат: """+КодСертификата+""" не инициализирован !",Отказ);							
			Иначе
				СертификатОбъект=Сертификат.ПолучитьОбъект();
				Если СокрЛП(СертификатОбъект.НомерЧекаВыдачи) <> "Подарок" Тогда
					
					//СертификатОбъект.Подарок				= Истина;
					//нечаева +++
					Если НЕ Подразделение.ВидПодразделения=перечисления.ВидыПодразделений.Франчайзинг Тогда
						СертификатОбъект.Подарок 		= Истина;
					КонецЕсли;
					//нечаева ---

					//крохин начало
					СертификатОбъект.НомерЧекаВыдачи = "Подарок";
					СертификатОбъект.ПриниматьКРасходамНУ = ПриниматьКРасходамНУ;
					//крохин конец
					СертификатОбъект.ДатаВыдачи 			= Дата;	
					СертификатОбъект.ПодразделениеЗатрат    = ПодразделениеЗатрат;
					//Кухарь 13.04.15 начало
					//СертификатОбъект.ПодразделениеВыдачи	= ПараметрыСеанса.ЭтотУзел.Подразделение;
					СертификатОбъект.ПодразделениеВыдачи	= Подразделение;
					//Кухарь 13.04.15 конец
					//крохин начало 03.03.2011
					//активация
					Если КодОперации = Перечисления.КодыОперацийПС.Активация Тогда
						СертификатОбъект.Подарок = Ложь;
						СертификатОбъект.НомерЧекаВыдачи = "Продажа";
					КонецЕсли;
					//крохин конец 03.03.2011
					//кухарь 13.05.14 начало
					если ДатаНачалаДействияСертификатов>ДатаОкончанияДействияСертификатов Тогда
						сообщить ("Не корректные даты действия сертификатов");
						Возврат;
					КонецЕсли;
					СертификатОбъект.НачалоДействия=ДатаНачалаДействияСертификатов;
					СертификатОбъект.ОкончаниеДействия=ДатаОкончанияДействияСертификатов;
					//кухарь 13.05.14 конец
					
					//кухарь 14.05.14 начало
					СертификатОбъект.МаксимальныйПроцентОтоваривания=МаксимальныйПроцентОтоваривания;
					//СертификатОбъект.Подразделения.Загрузить(Подразделения.Выгрузить());
					если МаксимальныйПроцентОтоваривания>0 тогда 
						СертификатОбъект.Владелец=Справочники.Номенклатура.НайтиПоКоду("SNL-348212");
					КонецЕсли;
					//кухарь 14.05.14 конец
					СертификатОбъект.Записать();
					//кухарь 19.05.14 начало
					РегПодр=РегистрыСведений.РеквизитыПодарочныхСертификатов;
					Отбор=новый Структура("Сертификат");
					//Отбор.Вставить("ИмяРеквизита");
					Отбор.Сертификат=СертификатОбъект.Ссылка;
					//Отбор.ИмяРеквизита="Подразделения";
					ВыбРегПодр=РегПодр.Выбрать(Отбор);
					Пока ВыбРегПодр.Следующий() Цикл
						если ВыбРегПодр.ИмяРеквизита="Подразделения" тогда
							ВыбРегПодр.ПолучитьМенеджерЗаписи().Удалить();
						КонецЕсли;
					КонецЦикла;
					если Подразделения.Количество()>0 Тогда
					НаборЗаписи=РегПодр.СоздатьНаборЗаписей();
					НаборЗаписи.Отбор.Сертификат.Значение=Сертификат;
					НаборЗаписи.Отбор.Сертификат.использование=Истина;
					НаборЗаписи.Отбор.ИмяРеквизита.значение="Подразделения";
					НаборЗаписи.Отбор.ИмяРеквизита.использование=Истина;
					Для каждого Подр из Подразделения цикл
						ТекСтр=НаборЗаписи.Добавить();
						ТекСтр.Сертификат=СертификатОбъект.Ссылка;
						ТекСтр.ИмяРеквизита="Подразделения";
						ТекСтр.ЗначениеРеквизита=Подр.Подразделение;
					КонецЦикла;
					НаборЗаписи.Записать();
					КонецЕсли;
					//кухарь 19.05.14 конец
					
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;		
	КонецЦикла;	
	//крохин начало
	Если Сертификаты.Количество() <> 0 И КодОперации=Перечисления.КодыОперацийПС.Инициализаиця Тогда
		СертификатыЭмитированы = Истина;
	КонецЕсли;
	Если Сертификаты.Количество() <> 0 И КодОперации=Перечисления.КодыОперацийПС.Дарение Тогда
		СертификатыАктивированы = Истина;
	КонецЕсли;
	//крохин начало 03.03.2011
	//активация ПС, аналогично дарению, но без проводок по остаткамТМЦ
	Если Сертификаты.Количество() <> 0 И КодОперации=Перечисления.КодыОперацийПС.Активация Тогда
		СертификатыАктивированы = Истина;
	КонецЕсли;
	//крохин конец 03.03.2011
	//крохин конец
	
	//крохин начало 04.12.2018
	//деактивация
	Если Сертификаты.Количество() <> 0 И КодОперации = Перечисления.КодыОперацийПС.Деактивация Тогда
	    СертификатыДеактивированы = Истина;	
	КонецЕсли;
	//крохин конец 04.12.2018
	
КонецПроцедуры


Процедура ОбработкаЗаполнения(Основание)	
	Если ТипЗнч(Основание)=Тип("Структура") Тогда Возврат КонецЕсли;
	Если Основание=Неопределено ИЛИ Основание.Пустая() Тогда Возврат КонецЕсли;
	
	ДокОснование= Основание;
	
	Организация = Основание.Организация;
	
	Сертификаты.Очистить();	
	//кухарь 05.03.14 начало
	ХПС=ПолучитьХПС(ДокОснование);
	если хпс<>Неопределено тогда
		Для каждого Серт из хпс.сертификаты цикл
			СертВЭмиссии=Сертификаты.Добавить();
			СертВЭмиссии.КодСертификата=Серт.кодсертификата;
			СертВЭмиссии.Номенклатура=серт.номенклатура;
			СертВЭмиссии.Номинал=серт.номинал;
		КонецЦикла;
	КонецЕсли;
	//кухарь 05.03.14 конец
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	Автор=Неопределено;	
	//крохин начало 05.03.2012
	СертификатыАктивированы = Ложь;
	СертификатыЭмитированы  = Ложь;
	//крохин конец 05.03.2012
	//крохин начало 04.12.2018
	СертификатыДеактивированы = Ложь;
	//крохин конец 04.12.2018
	Сертификаты.Очистить();	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)	
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.
	
	ЕстьИзменения	=Модифицированность();
	
	//крохин начало 27.07.2021
	//	//заявка на заведение ПС вводится в ТЦ
	//Если КодОперации=Перечисления.КодыОперацийПС.Дарение И РежимЗаписи=РежимЗаписиДокумента.Проведение Тогда
	//	НужноВыгружать	=НужноВыгружатьДокумент(ЕстьИзменения,Ссылка,РежимЗаписи,ПометкаУдаления);
	//Иначе
	//	НужноВыгружать	=Ложь;		
	//КонецЕсли;	
	//
			//Если ЕстьИзменения И КодОперации=Перечисления.КодыОперацийПС.Инициализаиця Тогда			
	//	Количество=Сертификаты.Количество();
	//КонецЕсли; 
	Если ЕстьИзменения Тогда
	НужноВыгружать	=НужноВыгружатьДокумент(ЕстьИзменения,Ссылка,РежимЗаписи,ПометкаУдаления);
Иначе
	НужноВыгружать = Ложь;	
	КонецЕсли;
    //крохин конец 27.07.2021
	
	Если НужноВыгружать Тогда
		УстановитьПолучателейИзмененийОбъекта(ЭтотОбъект);	
	КонецЕсли;
	
	//кухарь 13.03.14 начало	
	//перенёс
	//если ОбменДанными.Загрузка тогда
	//	Движения.СертификатныеОстатки.Записать();
	//КонецЕсли;
	//кухарь 13.03.14 конец		
КонецПроцедуры

//кухарь 05.03.14 начало
Функция ПолучитьХПС(ДокОснование)
	запрос=новый запрос;
	запрос.Текст="ВЫБРАТЬ
	|	ХранилищеПодарочныхСертификатов.Ссылка как ссылка
	|ИЗ
	|	Документ.ХранилищеПодарочныхСертификатов КАК ХранилищеПодарочныхСертификатов
	|ГДЕ
	|	ХранилищеПодарочныхСертификатов.ПометкаУдаления = Ложь
	|	И ХранилищеПодарочныхСертификатов.ДокОбъект = &ДокОснование";
	запрос.УстановитьПараметр("ДокОснование",ДокОснование);			 
	результат=запрос.Выполнить().Выгрузить();
	если результат.Количество()>0 тогда
		Возврат результат.Получить(0).ссылка;
	иначе
		Возврат Неопределено
	КонецЕсли;
КонецФункции
//кухарь 05.03.14 конец
